---
kind: property
id: P:Autodesk.Revit.DB.FilteredElementIterator.CurrentObject
source: html/d15847f8-25fc-bf50-04ce-423f19edec22.htm
---
# Autodesk.Revit.DB.FilteredElementIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```